//Операторы присваивания
let x = 5;

//Присваивание с добавлением
let y = 10;
y += 5; //y=15;

//Присваивание с вычитанием
y -= 3;
console.log(y); //12

//Присваивание с умножением
y *= 4;
console.log(y); //48

//Присваивание с делением
y /= 2;
console.log(y); //24

//Присваивание по остатку
y %= 9;
console.log(y); //6

//Присваивание c побитовым сдвигом влево
y <<= 2;
console.log(y); //24

//Присваивание c побитовым сдвигом вправо
y >>= 1;
console.log(y); //12

//Присваивание c побитовым сдвигом вправо c заполнением нулями
y >>>= 1;
console.log(y); //6
